Revit 2027 API
ExportLayerInfo.ColorNumber Property
 The color number stored in value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ColorNumber { get; set; }
Public Property ColorNumber As Integer
	Get
	Set
public:
property int ColorNumber {
	int get ();
	void set (int value);
}
member ColorNumber : int with get, set
Property Value
Int32
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace